cfe llm/Catalogs/AI_КартыИзвлечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_КартыИзвлечения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменятьСтрокиТабличныхЧастей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоНаименованию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_КартыИзвлечения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Карта — единственное описание полей: из нее выводится и схема ответа модели,
// и раскладка значений по реквизитам. Схему в сценарии переносим явной командой,
// чтобы на момент выполнения источником правды оставался сам сценарий.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьСпискиВыбора();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолноеИмяМетаданныхПриИзменении(Элемент)

	ОбновитьСпискиВыбора();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СинхронизироватьСхемуОбработка(Команда)

	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		Сообщить("Сначала запишите карту.");
		Возврат;
	КонецЕсли;

	Результат = СинхронизироватьСхемуНаСервере();
	Для Каждого Сообщение Из Результат.Сообщения Цикл
		Сообщить(Сообщение);
	КонецЦикла;
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		Сообщить(Результат.Ошибка);
		Возврат;
	КонецЕсли;
	Сообщить(СтрШаблон(
		"Сценариев обновлено: %1, уже совпадало: %2.",
		Результат.Обновлено,
		Результат.Пропущено));

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСхемуОбработка(Команда)

	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		Сообщить("Сначала запишите карту.");
		Возврат;
	КонецЕсли;

	Схема = ПолучитьСхемуНаСервере();
	Если ЗначениеЗаполнено(Схема.Ошибка) Тогда
		Сообщить(Схема.Ошибка);
		Возврат;
	КонецЕсли;
	ПоказатьЗначение(, Схема.Текст);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СинхронизироватьСхемуНаСервере()

	Результат = Новый Структура("Обновлено,Пропущено,Сообщения,Ошибка",
		0, 0, Новый Массив, "");
	Попытка
		Синхронизация = AI_ИзвлечениеРеквизитов.СинхронизироватьСхемуСценариев(Объект.Ссылка);
		ЗаполнитьЗначенияСвойств(Результат, Синхронизация);
	Исключение
		Результат.Ошибка = ОписаниеОшибки();
	КонецПопытки;
	Возврат Результат;

КонецФункции

// Табличные части и свойства берутся у объекта, к которому применима карта.
// Список подсказывает, но не ограничивает ввод: объекта может еще не быть в
// этой базе, а карта переносится пакетом.
&НаСервере
Процедура ОбновитьСпискиВыбора()

	СписокТабличныхЧастей = Элементы.ТабличнаяЧасть.СписокВыбора;
	СписокСвойств = Элементы.ДополнительныйРеквизит.СписокВыбора;
	СписокТабличныхЧастей.Очистить();
	СписокСвойств.Очистить();

	Варианты = AI_ИзвлечениеРеквизитов.ВариантыНастройкиКарты(Объект.ПолноеИмяМетаданных);
	Для Каждого Вариант Из Варианты.ТабличныеЧасти Цикл
		СписокТабличныхЧастей.Добавить(Вариант.Имя, Вариант.Представление);
	КонецЦикла;
	Для Каждого Вариант Из Варианты.ДополнительныеРеквизиты Цикл
		СписокСвойств.Добавить(Вариант.Имя, Вариант.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьСхемуНаСервере()

	Результат = Новый Структура("Текст,Ошибка", "", "");
	Попытка
		Результат.Текст = AI_ИзвлечениеРеквизитов.СформироватьСхемуОтвета(Объект.Ссылка);
	Исключение
		Результат.Ошибка = ОписаниеОшибки();
	КонецПопытки;
	Возврат Результат;

КонецФункции

#КонецОбласти
